Autodesk.Revit.DB.TextNoteOptions.TypeId
Id of a text type that defines the style of a text note.
Remarks:
No default value. A valid type element Id must be set prior using the options.
The text type allows its font name parameter to be set to a font unavailable on the current system.
However, any text note created with or set to this font type will be displayed in a default substituted font (e.g. Arial)
and the UI will show a blank value in the text type font name parameter.
Once the document is opened on a system which has the font set on the text type,
the text note will display with that font and the UI will show that font in the text type font name parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.#ctor(Autodesk.Revit.DB.ElementId)
Constructs text options to create text of the given type.
Remarks:
Except for the TypeId, all other properties of the option class will be populated with their respective default values.
typeId:
Id of a text type that defines the style of a text note.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017